# Создайте несколько переменных рвзных типов,
# Проверте к какому типу относятся даные переменные

a = 9 # int
b = 2.1 # float
c = 'Hello word' #str
d = { a,b,c} #set
e = [1,2,3] #list
f = {a:1, b:2} # dict
print(type(a),type(b),type(c),type(d),type(e),type(f))


